{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_init_scale",
      "attrs": {
        "__dtype__": "0",
        "__init__": "Constant_ssd0_vggatrousextractor0_init_scale_4739895696",
        "__lr_mult__": "1.0",
        "__shape__": "(1, 3, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "broadcast_mul",
      "name": "ssd0_vggatrousextractor0_broadcast_mul0",
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 3, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          2,
          0,
          0
        ],
        [
          3,
          0,
          0
        ],
        [
          4,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          5,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          6,
          0,
          0
        ],
        [
          7,
          0,
          0
        ],
        [
          8,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          9,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "ssd0_vggatrousextractor0_pooling0",
      "attrs": {
        "kernel": "(2, 2)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          10,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          11,
          0,
          0
        ],
        [
          12,
          0,
          0
        ],
        [
          13,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          14,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv3_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          15,
          0,
          0
        ],
        [
          16,
          0,
          0
        ],
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          18,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "ssd0_vggatrousextractor0_pooling1",
      "attrs": {
        "kernel": "(2, 2)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          19,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv4_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          20,
          0,
          0
        ],
        [
          21,
          0,
          0
        ],
        [
          22,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          23,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv5_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          24,
          0,
          0
        ],
        [
          25,
          0,
          0
        ],
        [
          26,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu5_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          27,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv6_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv6_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv6_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          28,
          0,
          0
        ],
        [
          29,
          0,
          0
        ],
        [
          30,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu6_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          31,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "ssd0_vggatrousextractor0_pooling2",
      "attrs": {
        "kernel": "(2, 2)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          32,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv7_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv7_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv7_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          33,
          0,
          0
        ],
        [
          34,
          0,
          0
        ],
        [
          35,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu7_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          36,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv8_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv8_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv8_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          37,
          0,
          0
        ],
        [
          38,
          0,
          0
        ],
        [
          39,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu8_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          40,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv9_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv9_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv9_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          41,
          0,
          0
        ],
        [
          42,
          0,
          0
        ],
        [
          43,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu9_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          44,
          0,
          0
        ]
      ]
    },
    {
      "op": "L2Normalization",
      "name": "ssd0_vggatrousextractor0_normalize0_l2normalization0",
      "attrs": {
        "eps": "1e-05",
        "mode": "channel"
      },
      "inputs": [
        [
          45,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_normalize0_normalize_scale",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"constant\", {\"value\": 20}]",
        "__lr_mult__": "1.0",
        "__shape__": "(1, 512, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "broadcast_mul",
      "name": "ssd0_vggatrousextractor0_normalize0_broadcast_mul0",
      "inputs": [
        [
          46,
          0,
          0
        ],
        [
          47,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(324, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(324,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "324",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          48,
          0,
          0
        ],
        [
          49,
          0,
          0
        ],
        [
          50,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose0",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          51,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten0",
      "inputs": [
        [
          52,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "ssd0_vggatrousextractor0_pooling3",
      "attrs": {
        "kernel": "(2, 2)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          45,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv10_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv10_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv10_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          54,
          0,
          0
        ],
        [
          55,
          0,
          0
        ],
        [
          56,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu10_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          57,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv11_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv11_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv11_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ],
        [
          60,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu11_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          61,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv12_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_conv12_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_conv12_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          0
        ],
        [
          64,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_relu12_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "ssd0_vggatrousextractor0_pooling4",
      "attrs": {
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          66,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_dilated_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(1024, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_dilated_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(1024,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_dilated_conv0_fwd",
      "attrs": {
        "dilate": "(6, 6)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "1024",
        "num_group": "1",
        "pad": "(6, 6)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          67,
          0,
          0
        ],
        [
          68,
          0,
          0
        ],
        [
          69,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_dilated_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          70,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_dilated_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(1024, 1024, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_dilated_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(1024,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_dilated_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "1024",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          71,
          0,
          0
        ],
        [
          72,
          0,
          0
        ],
        [
          73,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_dilated_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          74,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(486, 1024, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor2_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(486,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "486",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          75,
          0,
          0
        ],
        [
          76,
          0,
          0
        ],
        [
          77,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose1",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          78,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten1",
      "inputs": [
        [
          79,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 1024, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          75,
          0,
          0
        ],
        [
          81,
          0,
          0
        ],
        [
          82,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra0_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          83,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra0_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra0_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra0_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          84,
          0,
          0
        ],
        [
          85,
          0,
          0
        ],
        [
          86,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra0_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          87,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor4_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(486, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor4_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(486,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor4_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "486",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          88,
          0,
          0
        ],
        [
          89,
          0,
          0
        ],
        [
          90,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose2",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          91,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten2",
      "inputs": [
        [
          92,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra1_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 512, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra1_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra1_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          88,
          0,
          0
        ],
        [
          94,
          0,
          0
        ],
        [
          95,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra1_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          96,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra1_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra1_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra1_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          97,
          0,
          0
        ],
        [
          98,
          0,
          0
        ],
        [
          99,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra1_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          100,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor6_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(486, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor6_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(486,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor6_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "486",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          101,
          0,
          0
        ],
        [
          102,
          0,
          0
        ],
        [
          103,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose3",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          104,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten3",
      "inputs": [
        [
          105,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra2_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          101,
          0,
          0
        ],
        [
          107,
          0,
          0
        ],
        [
          108,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra2_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          109,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra2_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra2_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra2_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          110,
          0,
          0
        ],
        [
          111,
          0,
          0
        ],
        [
          112,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra2_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          113,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor8_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(486, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor8_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(486,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor8_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "486",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          114,
          0,
          0
        ],
        [
          115,
          0,
          0
        ],
        [
          116,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose4",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          117,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten4",
      "inputs": [
        [
          118,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra3_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra3_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra3_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          114,
          0,
          0
        ],
        [
          120,
          0,
          0
        ],
        [
          121,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra3_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          122,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra3_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra3_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra3_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          123,
          0,
          0
        ],
        [
          124,
          0,
          0
        ],
        [
          125,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra3_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          126,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor10_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"magnitude\": 2, \"factor_type\": \"avg\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(324, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_convpredictor10_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(324,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_convpredictor10_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "324",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          127,
          0,
          0
        ],
        [
          128,
          0,
          0
        ],
        [
          129,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "ssd0_transpose5",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          130,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "ssd0_flatten5",
      "inputs": [
        [
          131,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra4_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra4_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra4_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          127,
          0,
          0
        ],
        [
          133,
          0,
          0
        ],
        [
          134,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "ssd0_vggatrousextractor0_extra4_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          135,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra4_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"magnitude\": 2, \"factor_type\": \"out\"}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 4, 4)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "ssd0_vggatrousextractor0_extra4_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "ssd0_vggatrousextractor0_extra4_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(4, 4)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          136,
          0,
          0
        ],
        [
          137,
          0,
          0
        ],
        [
          138,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
