{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(96, 3, 7, 7)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(7, 7)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ],
        [
          2,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          3,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "squeezenet0_pool0_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          4,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(16, 96, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(16,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "16",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          5,
          0,
          0
        ],
        [
          6,
          0,
          0
        ],
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          8,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 16, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          9,
          0,
          0
        ],
        [
          10,
          0,
          0
        ],
        [
          11,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          12,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 16, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv3_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          9,
          0,
          0
        ],
        [
          14,
          0,
          0
        ],
        [
          15,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          16,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat0",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          13,
          0,
          0
        ],
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(16, 128, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv4_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(16,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "16",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          18,
          0,
          0
        ],
        [
          19,
          0,
          0
        ],
        [
          20,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          21,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 16, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv5_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          22,
          0,
          0
        ],
        [
          23,
          0,
          0
        ],
        [
          24,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu5_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          25,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv6_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 16, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv6_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv6_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          22,
          0,
          0
        ],
        [
          27,
          0,
          0
        ],
        [
          28,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu6_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          29,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat1",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          26,
          0,
          0
        ],
        [
          30,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv7_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 128, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv7_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv7_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          31,
          0,
          0
        ],
        [
          32,
          0,
          0
        ],
        [
          33,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu7_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          34,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv8_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 32, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv8_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv8_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          35,
          0,
          0
        ],
        [
          36,
          0,
          0
        ],
        [
          37,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu8_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          38,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv9_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv9_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv9_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          35,
          0,
          0
        ],
        [
          40,
          0,
          0
        ],
        [
          41,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu9_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat2",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          39,
          0,
          0
        ],
        [
          43,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "squeezenet0_pool1_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          44,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv10_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv10_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv10_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          45,
          0,
          0
        ],
        [
          46,
          0,
          0
        ],
        [
          47,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu10_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          48,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv11_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 32, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv11_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv11_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          49,
          0,
          0
        ],
        [
          50,
          0,
          0
        ],
        [
          51,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu11_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          52,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv12_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv12_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv12_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          49,
          0,
          0
        ],
        [
          54,
          0,
          0
        ],
        [
          55,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu12_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          56,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat3",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          53,
          0,
          0
        ],
        [
          57,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv13_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(48, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv13_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv13_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "48",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ],
        [
          60,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu13_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          61,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv14_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(192, 48, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv14_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv14_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          0
        ],
        [
          64,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu14_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv15_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(192, 48, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv15_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv15_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          62,
          0,
          0
        ],
        [
          67,
          0,
          0
        ],
        [
          68,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu15_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          69,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat4",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          66,
          0,
          0
        ],
        [
          70,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv16_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(48, 384, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv16_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv16_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "48",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          71,
          0,
          0
        ],
        [
          72,
          0,
          0
        ],
        [
          73,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu16_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          74,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv17_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(192, 48, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv17_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv17_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          75,
          0,
          0
        ],
        [
          76,
          0,
          0
        ],
        [
          77,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu17_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          78,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv18_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(192, 48, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv18_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv18_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          75,
          0,
          0
        ],
        [
          80,
          0,
          0
        ],
        [
          81,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu18_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          82,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat5",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          79,
          0,
          0
        ],
        [
          83,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv19_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 384, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv19_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv19_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          84,
          0,
          0
        ],
        [
          85,
          0,
          0
        ],
        [
          86,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu19_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          87,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv20_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv20_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv20_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          88,
          0,
          0
        ],
        [
          89,
          0,
          0
        ],
        [
          90,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu20_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          91,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv21_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv21_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv21_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          88,
          0,
          0
        ],
        [
          93,
          0,
          0
        ],
        [
          94,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu21_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          95,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat6",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          92,
          0,
          0
        ],
        [
          96,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "squeezenet0_pool2_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          97,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv22_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 512, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv22_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv22_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          98,
          0,
          0
        ],
        [
          99,
          0,
          0
        ],
        [
          100,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu22_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          101,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv23_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv23_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv23_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          102,
          0,
          0
        ],
        [
          103,
          0,
          0
        ],
        [
          104,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu23_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          105,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv24_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv24_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv24_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          102,
          0,
          0
        ],
        [
          107,
          0,
          0
        ],
        [
          108,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu24_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          109,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "squeezenet0_concat7",
      "attrs": {
        "dim": "1",
        "num_args": "2"
      },
      "inputs": [
        [
          106,
          0,
          0
        ],
        [
          110,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "squeezenet0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "cudnn_off": "False",
        "p": "0.5"
      },
      "inputs": [
        [
          111,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "squeezenet0_conv25_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(1000, 512, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "squeezenet0_conv25_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(1000,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "squeezenet0_conv25_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "1000",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          112,
          0,
          0
        ],
        [
          113,
          0,
          0
        ],
        [
          114,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "squeezenet0_relu25_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          115,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "squeezenet0_pool3_fwd",
      "attrs": {
        "count_include_pad": "True",
        "global_pool": "False",
        "kernel": "(13, 13)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "avg",
        "pooling_convention": "valid",
        "stride": "(13, 13)"
      },
      "inputs": [
        [
          116,
          0,
          0
        ]
      ]
    },
    {
      "op": "Flatten",
      "name": "squeezenet0_flatten0_flatten0",
      "inputs": [
        [
          117,
          0,
          0
        ]
      ]
    }
  ],
  "arg_nodes": [
    0,
    1,
    2,
    6,
    7,
    10,
    11,
    14,
    15,
    19,
    20,
    23,
    24,
    27,
    28,
    32,
    33,
    36,
    37,
    40,
    41,
    46,
    47,
    50,
    51,
    54,
    55,
    59,
    60,
    63,
    64,
    67,
    68,
    72,
    73,
    76,
    77,
    80,
    81,
    85,
    86,
    89,
    90,
    93,
    94,
    99,
    100,
    103,
    104,
    107,
    108,
    113,
    114
  ],
  "node_row_ptr": [
    0,
    1,
    2,
    3,
    4,
    5,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75,
    76,
    77,
    78,
    79,
    80,
    81,
    82,
    83,
    84,
    85,
    86,
    87,
    88,
    89,
    90,
    91,
    92,
    93,
    94,
    95,
    96,
    97,
    98,
    99,
    100,
    102,
    103,
    104,
    105,
    106,
    107,
    108,
    109,
    110,
    111,
    112,
    113,
    114,
    115,
    117,
    118,
    119,
    120,
    121,
    122,
    123
  ],
  "heads": [
    [
      118,
      0,
      0
    ]
  ],
  "attrs": {
    "mxnet_version": [
      "int",
      10500
    ]
  }
}