{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 3, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_batchnormcudnnoff0_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          2,
          0,
          0
        ],
        [
          3,
          0,
          0
        ],
        [
          4,
          0,
          0
        ],
        [
          5,
          0,
          1
        ],
        [
          6,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          8,
          0,
          0
        ],
        [
          9,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_batchnormcudnnoff1_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          10,
          0,
          0
        ],
        [
          11,
          0,
          0
        ],
        [
          12,
          0,
          0
        ],
        [
          13,
          0,
          1
        ],
        [
          14,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          15,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          16,
          0,
          0
        ],
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_batchnormcudnnoff2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_batchnormcudnnoff2_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          18,
          0,
          0
        ],
        [
          19,
          0,
          0
        ],
        [
          20,
          0,
          0
        ],
        [
          21,
          0,
          1
        ],
        [
          22,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          23,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "resnetv1d_pool0_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(1, 1)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          24,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          25,
          0,
          0
        ],
        [
          26,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff0_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          27,
          0,
          0
        ],
        [
          28,
          0,
          0
        ],
        [
          29,
          0,
          0
        ],
        [
          30,
          0,
          1
        ],
        [
          31,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          32,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          33,
          0,
          0
        ],
        [
          34,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff1_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          35,
          0,
          0
        ],
        [
          36,
          0,
          0
        ],
        [
          37,
          0,
          0
        ],
        [
          38,
          0,
          1
        ],
        [
          39,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          40,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          41,
          0,
          0
        ],
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff2_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          43,
          0,
          0
        ],
        [
          44,
          0,
          0
        ],
        [
          45,
          0,
          0
        ],
        [
          46,
          0,
          1
        ],
        [
          47,
          0,
          1
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "resnetv1d_down1_pool0_fwd",
      "attrs": {
        "count_include_pad": "False",
        "global_pool": "False",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "avg",
        "pooling_convention": "full",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          25,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_down1_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_down1_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          49,
          0,
          0
        ],
        [
          50,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_down1_batchnormcudnnoff0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down1_batchnormcudnnoff0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down1_batchnormcudnnoff0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down1_batchnormcudnnoff0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_down1_batchnormcudnnoff0_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          51,
          0,
          0
        ],
        [
          52,
          0,
          0
        ],
        [
          53,
          0,
          0
        ],
        [
          54,
          0,
          1
        ],
        [
          55,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1d_layers1_bottleneckv1b0__plus0",
      "inputs": [
        [
          48,
          0,
          0
        ],
        [
          56,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          57,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff3_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          61,
          0,
          0
        ],
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          1
        ],
        [
          64,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          66,
          0,
          0
        ],
        [
          67,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff4_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff4_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff4_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff4_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff4_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          68,
          0,
          0
        ],
        [
          69,
          0,
          0
        ],
        [
          70,
          0,
          0
        ],
        [
          71,
          0,
          1
        ],
        [
          72,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          73,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          74,
          0,
          0
        ],
        [
          75,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff5_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff5_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff5_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff5_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff5_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          76,
          0,
          0
        ],
        [
          77,
          0,
          0
        ],
        [
          78,
          0,
          0
        ],
        [
          79,
          0,
          1
        ],
        [
          80,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1d_layers1_bottleneckv1b1__plus0",
      "inputs": [
        [
          81,
          0,
          0
        ],
        [
          58,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu5_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          82,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv6_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv6_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          83,
          0,
          0
        ],
        [
          84,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff6_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff6_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff6_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff6_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff6_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          85,
          0,
          0
        ],
        [
          86,
          0,
          0
        ],
        [
          87,
          0,
          0
        ],
        [
          88,
          0,
          1
        ],
        [
          89,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu6_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          90,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv7_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv7_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          91,
          0,
          0
        ],
        [
          92,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff7_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff7_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff7_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff7_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff7_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          93,
          0,
          0
        ],
        [
          94,
          0,
          0
        ],
        [
          95,
          0,
          0
        ],
        [
          96,
          0,
          1
        ],
        [
          97,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu7_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          98,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_conv8_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers1_conv8_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          99,
          0,
          0
        ],
        [
          100,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff8_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff8_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff8_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers1_batchnormcudnnoff8_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers1_batchnormcudnnoff8_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          101,
          0,
          0
        ],
        [
          102,
          0,
          0
        ],
        [
          103,
          0,
          0
        ],
        [
          104,
          0,
          1
        ],
        [
          105,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1d_layers1_bottleneckv1b2__plus0",
      "inputs": [
        [
          106,
          0,
          0
        ],
        [
          83,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers1_relu8_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          107,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          108,
          0,
          0
        ],
        [
          109,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers2_batchnormcudnnoff0_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          110,
          0,
          0
        ],
        [
          111,
          0,
          0
        ],
        [
          112,
          0,
          0
        ],
        [
          113,
          0,
          1
        ],
        [
          114,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers2_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          115,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers2_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          117,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers2_batchnormcudnnoff1_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          118,
          0,
          0
        ],
        [
          119,
          0,
          0
        ],
        [
          120,
          0,
          0
        ],
        [
          121,
          0,
          1
        ],
        [
          122,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1d_layers2_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          123,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 128, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_layers2_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          124,
          0,
          0
        ],
        [
          125,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_layers2_batchnormcudnnoff2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_layers2_batchnormcudnnoff2_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          126,
          0,
          0
        ],
        [
          127,
          0,
          0
        ],
        [
          128,
          0,
          0
        ],
        [
          129,
          0,
          1
        ],
        [
          130,
          0,
          1
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "resnetv1d_down2_pool0_fwd",
      "attrs": {
        "count_include_pad": "False",
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "avg",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          108,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_down2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1d_down2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          132,
          0,
          0
        ],
        [
          133,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1d_down2_batchnormcudnnoff0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down2_batchnormcudnnoff0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down2_batchnormcudnnoff0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1d_down2_batchnormcudnnoff0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1d_down2_batchnormcudnnoff0_fwd",
      "attrs": {
        "axis": "1",
        "cudnn_off": "True",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          134,
          0,
          0
        ],
        [
          135,
          0,
          0
        ],
        [
          136,
          0,
          0
        ],
        [
          137,
          0,
          1
        ],
        [
          138,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1d_layers2_bottleneckv1b0__plus0",
      "inputs": [
