{
  "nodes": [
    {
      "op": "_arange",
      "name": "staticbertencoder0__arange0",
      "attrs": {
        "dtype": "float32",
        "infer_range": "False",
        "repeat": "1",
        "start": "384",
        "step": "1.0",
        "stop": "None"
      },
      "inputs": []
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_reshape0",
      "attrs": {
        "shape": "(1, -1)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "data2",
      "inputs": []
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_reshape1",
      "attrs": {
        "shape": "(-1, 1)"
      },
      "inputs": [
        [
          2,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_lesser",
      "name": "staticbertencoder0_broadcast_lesser0",
      "inputs": [
        [
          1,
          0,
          0
        ],
        [
          3,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          4,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_broadcast_axes0",
      "attrs": {
        "axis": "1",
        "size": "384"
      },
      "inputs": [
        [
          5,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer11_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer11_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer11_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          8,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer10_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer10_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          10,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer10_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          11,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer9_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer9_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          13,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer9_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          14,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer8_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer8_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          16,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer8_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer7_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer7_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          19,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer7_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          20,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer6_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer6_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          22,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer6_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          23,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer5_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer5_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          25,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer5_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          26,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer4_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer4_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          28,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer4_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          29,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer3_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer3_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          31,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer3_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          32,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer2_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer2_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          34,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer2_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          35,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          37,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          38,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_expand_dims0",
      "attrs": {
        "axis": "1"
      },
      "inputs": [
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_axis",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_broadcast_axis0",
      "attrs": {
        "axis": "1",
        "size": "12"
      },
      "inputs": [
        [
          40,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape4",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          41,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "data0",
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertmodel0_word_embed_embedding0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(30522, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Embedding",
      "name": "staticbertmodel0_word_embed_embedding0_fwd",
      "attrs": {
        "dtype": "float32",
        "input_dim": "30522",
        "output_dim": "768",
        "sparse_grad": "False"
      },
      "inputs": [
        [
          43,
          0,
          0
        ],
        [
          44,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertmodel0_word_embed_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          45,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "data1",
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertmodel0_token_type_embed_embedding0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(2, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Embedding",
      "name": "staticbertmodel0_token_type_embed_embedding0_fwd",
      "attrs": {
        "dtype": "float32",
        "input_dim": "2",
        "output_dim": "768",
        "sparse_grad": "False"
      },
      "inputs": [
        [
          47,
          0,
          0
        ],
        [
          48,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertmodel0_token_type_embed_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          49,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "staticbertmodel0__plus0",
      "inputs": [
        [
          46,
          0,
          0
        ],
        [
          50,
          0,
          0
        ]
      ]
    },
    {
      "op": "_arange",
      "name": "staticbertencoder0__arange1",
      "attrs": {
        "dtype": "float32",
        "infer_range": "False",
        "repeat": "1",
        "start": "384",
        "step": "1.0",
        "stop": "None"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_position_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Embedding",
      "name": "staticbertencoder0_embedding0",
      "attrs": {
        "input_dim": "512",
        "output_dim": "768"
      },
      "inputs": [
        [
          52,
          0,
          0
        ],
        [
          53,
          0,
          0
        ]
      ]
    },
    {
      "op": "expand_dims",
      "name": "staticbertencoder0_expand_dims1",
      "attrs": {
        "axis": "0"
      },
      "inputs": [
        [
          54,
          0,
          0
        ]
      ]
    },
    {
      "op": "broadcast_add",
      "name": "staticbertencoder0_broadcast_add0",
      "inputs": [
        [
          51,
          0,
          0
        ],
        [
          55,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          56,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_bertlayernorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_bertlayernorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "LayerNorm",
      "name": "staticbertencoder0_bertlayernorm0_layernorm0",
      "attrs": {
        "axis": "-1",
        "eps": "1e-12"
      },
      "inputs": [
        [
          57,
          0,
          0
        ],
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_query_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_query_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_query_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          61,
          0,
          0
        ],
        [
          62,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape0",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          63,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_transpose0",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          64,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape1",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "_contrib_div_sqrt_dim",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_div_sqrt_dim0",
      "inputs": [
        [
          66,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_key_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_key_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_key_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          68,
          0,
          0
        ],
        [
          69,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape2",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          70,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_transpose1",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          71,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape3",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          72,
          0,
          0
        ]
      ]
    },
    {
      "op": "batch_dot",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_batch_dot0",
      "attrs": {
        "transpose_b": "True"
      },
      "inputs": [
        [
          67,
          0,
          0
        ],
        [
          73,
          0,
          0
        ]
      ]
    },
    {
      "op": "ones_like",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_ones_like0",
      "inputs": [
        [
          74,
          0,
          0
        ]
      ]
    },
    {
      "op": "_mul_scalar",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0__mulscalar0",
      "attrs": {
        "scalar": "-1e+18"
      },
      "inputs": [
        [
          75,
          0,
          0
        ]
      ]
    },
    {
      "op": "where",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_where0",
      "inputs": [
        [
          42,
          0,
          0
        ],
        [
          74,
          0,
          0
        ],
        [
          76,
          0,
          0
        ]
      ]
    },
    {
      "op": "softmax",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_softmax0",
      "attrs": {
        "axis": "-1"
      },
      "inputs": [
        [
          77,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_mul",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0__mul0",
      "inputs": [
        [
          78,
          0,
          0
        ],
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer0_dotproductattentioncell0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          79,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape5",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 12, 0, 0)"
      },
      "inputs": [
        [
          80,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape6",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          81,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_value_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_value_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_value_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          83,
          0,
          0
        ],
        [
          84,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape7",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          85,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_transpose2",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          86,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape8",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          87,
          0,
          0
        ]
      ]
    },
    {
      "op": "batch_dot",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_batch_dot1",
      "inputs": [
        [
          82,
          0,
          0
        ],
        [
          88,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape9",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 12, 0, 0)"
      },
      "inputs": [
        [
          89,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_transpose3",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          90,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer0_multiheadattentioncell0_reshape10",
      "attrs": {
        "shape": "(0, 0, -1)"
      },
      "inputs": [
        [
          91,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_proj_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_proj_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_proj_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          92,
          0,
          0
        ],
        [
          93,
          0,
          0
        ],
        [
          94,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          95,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "staticbertencoder0_transformer0__plus0",
      "inputs": [
        [
          96,
          0,
          0
        ],
        [
          60,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertlayernorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertlayernorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "LayerNorm",
      "name": "staticbertencoder0_transformer0_bertlayernorm0_layernorm0",
      "attrs": {
        "axis": "-1",
        "eps": "1e-12"
      },
      "inputs": [
        [
          97,
          0,
          0
        ],
        [
          98,
          0,
          0
        ],
        [
          99,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(3072, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(3072,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_1_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "3072"
      },
      "inputs": [
        [
          100,
          0,
          0
        ],
        [
          101,
          0,
          0
        ],
        [
          102,
          0,
          0
        ]
      ]
    },
    {
      "op": "_mul_scalar",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_gelu0__mulscalar0",
      "attrs": {
        "scalar": "0.5"
      },
      "inputs": [
        [
          103,
          0,
          0
        ]
      ]
    },
    {
      "op": "_div_scalar",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_gelu0__divscalar0",
      "attrs": {
        "scalar": "1.4142135623730951"
      },
      "inputs": [
        [
          103,
          0,
          0
        ]
      ]
    },
    {
      "op": "erf",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_gelu0_erf0",
      "inputs": [
        [
          105,
          0,
          0
        ]
      ]
    },
    {
      "op": "_plus_scalar",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_gelu0__plusscalar0",
      "attrs": {
        "scalar": "1.0"
      },
      "inputs": [
        [
          106,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_mul",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_gelu0__mul0",
      "inputs": [
        [
          104,
          0,
          0
        ],
        [
          107,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 3072)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_ffn_2_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          108,
          0,
          0
        ],
        [
          109,
          0,
          0
        ],
        [
          110,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          111,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0__plus0",
      "inputs": [
        [
          112,
          0,
          0
        ],
        [
          100,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "LayerNorm",
      "name": "staticbertencoder0_transformer0_bertpositionwiseffn0_bertlayernorm0_layernorm0",
      "attrs": {
        "axis": "-1",
        "eps": "1e-12"
      },
      "inputs": [
        [
          113,
          0,
          0
        ],
        [
          114,
          0,
          0
        ],
        [
          115,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_query_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_query_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_query_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          117,
          0,
          0
        ],
        [
          118,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape0",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          119,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_transpose0",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          120,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape1",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          121,
          0,
          0
        ]
      ]
    },
    {
      "op": "_contrib_div_sqrt_dim",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_div_sqrt_dim0",
      "inputs": [
        [
          122,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_key_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_key_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_key_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          124,
          0,
          0
        ],
        [
          125,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape2",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          126,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_transpose1",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          127,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape3",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          128,
          0,
          0
        ]
      ]
    },
    {
      "op": "batch_dot",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_batch_dot0",
      "attrs": {
        "transpose_b": "True"
      },
      "inputs": [
        [
          123,
          0,
          0
        ],
        [
          129,
          0,
          0
        ]
      ]
    },
    {
      "op": "ones_like",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_ones_like0",
      "inputs": [
        [
          130,
          0,
          0
        ]
      ]
    },
    {
      "op": "_mul_scalar",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0__mulscalar0",
      "attrs": {
        "scalar": "-1e+18"
      },
      "inputs": [
        [
          131,
          0,
          0
        ]
      ]
    },
    {
      "op": "where",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_where0",
      "inputs": [
        [
          39,
          0,
          0
        ],
        [
          130,
          0,
          0
        ],
        [
          132,
          0,
          0
        ]
      ]
    },
    {
      "op": "softmax",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_softmax0",
      "attrs": {
        "axis": "-1"
      },
      "inputs": [
        [
          133,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_mul",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0__mul0",
      "inputs": [
        [
          134,
          0,
          0
        ],
        [
          39,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer1_dotproductattentioncell0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          135,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape5",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 12, 0, 0)"
      },
      "inputs": [
        [
          136,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape6",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          137,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_value_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_value_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_value_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          139,
          0,
          0
        ],
        [
          140,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape7",
      "attrs": {
        "shape": "(0, 0, 12, -1)"
      },
      "inputs": [
        [
          141,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_transpose2",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          142,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape8",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 0, 0)"
      },
      "inputs": [
        [
          143,
          0,
          0
        ]
      ]
    },
    {
      "op": "batch_dot",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_batch_dot1",
      "inputs": [
        [
          138,
          0,
          0
        ],
        [
          144,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape9",
      "attrs": {
        "reverse": "True",
        "shape": "(-1, 12, 0, 0)"
      },
      "inputs": [
        [
          145,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_transpose3",
      "attrs": {
        "axes": "(0, 2, 1, 3)"
      },
      "inputs": [
        [
          146,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "staticbertencoder0_transformer1_multiheadattentioncell0_reshape10",
      "attrs": {
        "shape": "(0, 0, -1)"
      },
      "inputs": [
        [
          147,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_proj_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_proj_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_proj_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          148,
          0,
          0
        ],
        [
          149,
          0,
          0
        ],
        [
          150,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer1_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          151,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "staticbertencoder0_transformer1__plus0",
      "inputs": [
        [
          152,
          0,
          0
        ],
        [
          116,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertlayernorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertlayernorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "LayerNorm",
      "name": "staticbertencoder0_transformer1_bertlayernorm0_layernorm0",
      "attrs": {
        "axis": "-1",
        "eps": "1e-12"
      },
      "inputs": [
        [
          153,
          0,
          0
        ],
        [
          154,
          0,
          0
        ],
        [
          155,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(3072, 768)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(3072,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_1_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "3072"
      },
      "inputs": [
        [
          156,
          0,
          0
        ],
        [
          157,
          0,
          0
        ],
        [
          158,
          0,
          0
        ]
      ]
    },
    {
      "op": "_mul_scalar",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_gelu0__mulscalar0",
      "attrs": {
        "scalar": "0.5"
      },
      "inputs": [
        [
          159,
          0,
          0
        ]
      ]
    },
    {
      "op": "_div_scalar",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_gelu0__divscalar0",
      "attrs": {
        "scalar": "1.4142135623730951"
      },
      "inputs": [
        [
          159,
          0,
          0
        ]
      ]
    },
    {
      "op": "erf",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_gelu0_erf0",
      "inputs": [
        [
          161,
          0,
          0
        ]
      ]
    },
    {
      "op": "_plus_scalar",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_gelu0__plusscalar0",
      "attrs": {
        "scalar": "1.0"
      },
      "inputs": [
        [
          162,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_mul",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_gelu0__mul0",
      "inputs": [
        [
          160,
          0,
          0
        ],
        [
          163,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(768, 3072)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_ffn_2_fwd",
      "attrs": {
        "flatten": "False",
        "no_bias": "False",
        "num_hidden": "768"
      },
      "inputs": [
        [
          164,
          0,
          0
        ],
        [
          165,
          0,
          0
        ],
        [
          166,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "p": "0.1"
      },
      "inputs": [
        [
          167,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0__plus0",
      "inputs": [
        [
          168,
          0,
          0
        ],
        [
          156,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_bertlayernorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(768,)",
        "__storage_type__": "0",
        "__wd_mult__": "0.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "staticbertencoder0_transformer1_bertpositionwiseffn0_bertlayernorm0_beta",
