{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 3, 7, 7)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(7, 7)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(3, 3)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          2,
          0,
          0
        ],
        [
          3,
          0,
          0
        ],
        [
          4,
          0,
          0
        ],
        [
          5,
          0,
          1
        ],
        [
          6,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "resnetv1b_pool0_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(1, 1)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          8,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers1_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          9,
          0,
          0
        ],
        [
          10,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers1_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          11,
          0,
          0
        ],
        [
          12,
          0,
          0
        ],
        [
          13,
          0,
          0
        ],
        [
          14,
          0,
          1
        ],
        [
          15,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers1_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          16,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers1_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          17,
          0,
          0
        ],
        [
          18,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers1_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          19,
          0,
          0
        ],
        [
          20,
          0,
          0
        ],
        [
          21,
          0,
          0
        ],
        [
          22,
          0,
          1
        ],
        [
          23,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers1_basicblockv1b0__plus0",
      "inputs": [
        [
          24,
          0,
          0
        ],
        [
          9,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers1_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          25,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers1_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          26,
          0,
          0
        ],
        [
          27,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers1_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          28,
          0,
          0
        ],
        [
          29,
          0,
          0
        ],
        [
          30,
          0,
          0
        ],
        [
          31,
          0,
          1
        ],
        [
          32,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers1_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          33,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers1_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          34,
          0,
          0
        ],
        [
          35,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers1_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers1_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          36,
          0,
          0
        ],
        [
          37,
          0,
          0
        ],
        [
          38,
          0,
          0
        ],
        [
          39,
          0,
          1
        ],
        [
          40,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers1_basicblockv1b1__plus0",
      "inputs": [
        [
          41,
          0,
          0
        ],
        [
          26,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers1_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          43,
          0,
          0
        ],
        [
          44,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers2_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          45,
          0,
          0
        ],
        [
          46,
          0,
          0
        ],
        [
          47,
          0,
          0
        ],
        [
          48,
          0,
          1
        ],
        [
          49,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers2_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          50,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers2_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          51,
          0,
          0
        ],
        [
          52,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers2_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          53,
          0,
          0
        ],
        [
          54,
          0,
          0
        ],
        [
          55,
          0,
          0
        ],
        [
          56,
          0,
          1
        ],
        [
          57,
          0,
          1
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_down2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_down2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          43,
          0,
          0
        ],
        [
          59,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_down2_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down2_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down2_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down2_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_down2_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          61,
          0,
          0
        ],
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          1
        ],
        [
          64,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers2_basicblockv1b0__plus0",
      "inputs": [
        [
          58,
          0,
          0
        ],
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers2_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          66,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers2_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          67,
          0,
          0
        ],
        [
          68,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers2_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          69,
          0,
          0
        ],
        [
          70,
          0,
          0
        ],
        [
          71,
          0,
          0
        ],
        [
          72,
          0,
          1
        ],
        [
          73,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers2_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          74,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers2_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          75,
          0,
          0
        ],
        [
          76,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers2_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers2_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          77,
          0,
          0
        ],
        [
          78,
          0,
          0
        ],
        [
          79,
          0,
          0
        ],
        [
          80,
          0,
          1
        ],
        [
          81,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers2_basicblockv1b1__plus0",
      "inputs": [
        [
          82,
          0,
          0
        ],
        [
          67,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers2_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          83,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers3_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          84,
          0,
          0
        ],
        [
          85,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers3_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          86,
          0,
          0
        ],
        [
          87,
          0,
          0
        ],
        [
          88,
          0,
          0
        ],
        [
          89,
          0,
          1
        ],
        [
          90,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers3_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          91,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers3_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          92,
          0,
          0
        ],
        [
          93,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers3_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          94,
          0,
          0
        ],
        [
          95,
          0,
          0
        ],
        [
          96,
          0,
          0
        ],
        [
          97,
          0,
          1
        ],
        [
          98,
          0,
          1
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_down3_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_down3_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          84,
          0,
          0
        ],
        [
          100,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_down3_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down3_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down3_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_down3_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_down3_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          101,
          0,
          0
        ],
        [
          102,
          0,
          0
        ],
        [
          103,
          0,
          0
        ],
        [
          104,
          0,
          1
        ],
        [
          105,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers3_basicblockv1b0__plus0",
      "inputs": [
        [
          99,
          0,
          0
        ],
        [
          106,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers3_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          107,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers3_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          108,
          0,
          0
        ],
        [
          109,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers3_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          110,
          0,
          0
        ],
        [
          111,
          0,
          0
        ],
        [
          112,
          0,
          0
        ],
        [
          113,
          0,
          1
        ],
        [
          114,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers3_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          115,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "resnetv1b_layers3_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          117,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "resnetv1b_layers3_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "resnetv1b_layers3_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "1e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [
        [
          118,
          0,
          0
        ],
        [
          119,
          0,
          0
        ],
        [
          120,
          0,
          0
        ],
        [
          121,
          0,
          1
        ],
        [
          122,
          0,
          1
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "resnetv1b_layers3_basicblockv1b1__plus0",
      "inputs": [
        [
          123,
          0,
          0
        ],
        [
          108,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "resnetv1b_layers3_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          124,
          0,
          0
        ]
      ]
    },
    {
      "op": "_arange",
      "name": "maskrcnn0__arange0",
      "attrs": {
        "dtype": "float32",
        "infer_range": "False",
        "repeat": "1",
        "start": "0",
        "step": "1.0",
        "stop": "1"
      },
      "inputs": []
    },
    {
      "op": "repeat",
      "name": "maskrcnn0_repeat0",
      "attrs": {
        "repeats": "1000"
      },
      "inputs": [
        [
          126,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "maskrcnn0_reshape0",
      "attrs": {
        "shape": "(-1, 1)"
      },
      "inputs": [
        [
          127,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "maskrcnn0_rpn0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"normal\", {\"sigma\": 0.01}]",
        "__lr_mult__": "1.0",
        "__shape__": "(1024, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "maskrcnn0_rpn0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(1024,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "maskrcnn0_rpn0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "1024",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          125,
          0,
          0
        ],
        [
          129,
          0,
          0
        ],
        [
          130,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "maskrcnn0_rpn0_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          131,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "maskrcnn0_rpn0_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"normal\", {\"sigma\": 0.01}]",
        "__lr_mult__": "1.0",
        "__shape__": "(60, 1024, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "maskrcnn0_rpn0_conv2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(60,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "maskrcnn0_rpn0_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "60",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          132,
          0,
          0
        ],
        [
          133,
          0,
          0
        ],
        [
          134,
          0,
          0
        ]
      ]
    },
    {
      "op": "transpose",
      "name": "maskrcnn0_rpn0_transpose1",
      "attrs": {
        "axes": "(0, 2, 3, 1)"
      },
      "inputs": [
        [
          135,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "maskrcnn0_rpn0_reshape1",
      "attrs": {
        "shape": "(0, -1, 4)"
      },
      "inputs": [
        [
          136,
          0,
          0
        ]
      ]
    },
    {
      "op": "BlockGrad",
      "name": "maskrcnn0_rpn0_stop_gradient1",
      "inputs": [
        [
          137,
          0,
          0
        ]
      ]
    },
    {
      "op": "SliceChannel",
      "name": "maskrcnn0_rpn0_normalizedboxcenterdecoder0_split1",
      "attrs": {
        "axis": "-1",
        "num_outputs": "4"
      },
      "inputs": [
        [
          138,
          0,
          0
        ]
      ]
    },
    {
      "op": "_mul_scalar",
      "name": "maskrcnn0_rpn0_normalizedboxcenterdecoder0__mulscalar0",
      "attrs": {
        "scalar": "1.0"
      },
      "inputs": [
        [
          139,
          0,
          0
        ]
      ]
    },
    {
      "op": "_plus_scalar",
      "name": "maskrcnn0_rpn0_normalizedboxcenterdecoder0__plusscalar0",
      "attrs": {
        "scalar": "0.0"
      },
      "inputs": [
        [
          140,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "maskrcnn0_rpn0_rpnanchorgenerator0_anchor_",
      "attrs": {
        "__dtype__": "0",
        "__init__": "Constant_maskrcnn0_rpn0_rpnanchorgenerator0_anchor__4914717192",
        "__lr_mult__": "1.0",
        "__shape__": "(1, 1, 128, 128, 60)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "_mul_scalar",
      "name": "maskrcnn0_rpn0_rpnanchorgenerator0__mulscalar0",
      "attrs": {
        "scalar": "0"
      },
      "inputs": [
        [
          125,
          0,
          0
        ]
      ]
    },
    {
      "op": "slice_like",
      "name": "maskrcnn0_rpn0_rpnanchorgenerator0_slice_like0",
      "attrs": {
        "axes": "(2, 3)"
      },
      "inputs": [
        [
          142,
          0,
          0
        ],
        [
          143,
          0,
          0
        ]
      ]
    },
    {
      "op": "Reshape",
      "name": "maskrcnn0_rpn0_rpnanchorgenerator0_reshape0",
      "attrs": {
        "shape": "(1, -1, 4)"
      },
      "inputs": [
        [
          144,
          0,
          0
        ]
      ]
    },
    {
      "op": "SliceChannel",
      "name": "maskrcnn0_rpn0_bboxcornertocenter0_split0",
      "attrs": {
        "axis": "-1",
        "num_outputs": "4"
      },
      "inputs": [
        [
          145,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_sub",
      "name": "maskrcnn0_rpn0_bboxcornertocenter0__minus0",
      "inputs": [
        [
          146,
          2,
          0
        ],
        [
          146,
          0,
          0
        ]
      ]
    },
    {
      "op": "_div_scalar",
      "name": "maskrcnn0_rpn0_bboxcornertocenter0__divscalar0",
      "attrs": {
        "scalar": "2"
      },
      "inputs": [
        [
          147,
          0,
          0
        ]
      ]
    },
    {
      "op": "elemwise_add",
      "name": "maskrcnn0_rpn0_bboxcornertocenter0__plus0",
      "inputs": [
        [
