{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 3, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          2,
          0,
          0
        ],
        [
          3,
          0,
          0
        ],
        [
          4,
          0,
          0
        ],
        [
          5,
          0,
          1
        ],
        [
          6,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          8,
          0,
          0
        ],
        [
          9,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          10,
          0,
          0
        ],
        [
          11,
          0,
          0
        ],
        [
          12,
          0,
          0
        ],
        [
          13,
          0,
          1
        ],
        [
          14,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          15,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 32, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          16,
          0,
          0
        ],
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          18,
          0,
          0
        ],
        [
          19,
          0,
          0
        ],
        [
          20,
          0,
          0
        ],
        [
          21,
          0,
          1
        ],
        [
          22,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          23,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "inception30_pool0_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          24,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(80, 64, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "80",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          25,
          0,
          0
        ],
        [
          26,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(80,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(80,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(80,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(80,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          27,
          0,
          0
        ],
        [
          28,
          0,
          0
        ],
        [
          29,
          0,
          0
        ],
        [
          30,
          0,
          1
        ],
        [
          31,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          32,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(192, 80, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          33,
          0,
          0
        ],
        [
          34,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_batchnorm4_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm4_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm4_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_batchnorm4_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(192,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_batchnorm4_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          35,
          0,
          0
        ],
        [
          36,
          0,
          0
        ],
        [
          37,
          0,
          0
        ],
        [
          38,
          0,
          1
        ],
        [
          39,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          40,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "inception30_pool1_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          41,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 192, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          42,
          0,
          0
        ],
        [
          43,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          44,
          0,
          0
        ],
        [
          45,
          0,
          0
        ],
        [
          46,
          0,
          0
        ],
        [
          47,
          0,
          1
        ],
        [
          48,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          49,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(48, 192, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "48",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          42,
          0,
          0
        ],
        [
          51,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          52,
          0,
          0
        ],
        [
          53,
          0,
          0
        ],
        [
          54,
          0,
          0
        ],
        [
          55,
          0,
          1
        ],
        [
          56,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          57,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 48, 5, 5)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(5, 5)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(2, 2)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          60,
          0,
          0
        ],
        [
          61,
          0,
          0
        ],
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          1
        ],
        [
          64,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 192, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          42,
          0,
          0
        ],
        [
          67,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          68,
          0,
          0
        ],
        [
          69,
          0,
          0
        ],
        [
          70,
          0,
          0
        ],
        [
          71,
          0,
          1
        ],
        [
          72,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          73,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(96, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          74,
          0,
          0
        ],
        [
          75,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm4_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm4_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm4_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm4_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm4_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          76,
          0,
          0
        ],
        [
          77,
          0,
          0
        ],
        [
          78,
          0,
          0
        ],
        [
          79,
          0,
          1
        ],
        [
          80,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          81,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(96, 96, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          82,
          0,
          0
        ],
        [
          83,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm5_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm5_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm5_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm5_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm5_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          84,
          0,
          0
        ],
        [
          85,
          0,
          0
        ],
        [
          86,
          0,
          0
        ],
        [
          87,
          0,
          1
        ],
        [
          88,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu5_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          89,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "inception30_A1_pool0_fwd",
      "attrs": {
        "count_include_pad": "True",
        "global_pool": "False",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "pad": "(1, 1)",
        "pool_type": "avg",
        "pooling_convention": "valid",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_conv6_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(32, 192, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A1_conv6_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          91,
          0,
          0
        ],
        [
          92,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm6_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm6_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm6_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A1_batchnorm6_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(32,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A1_batchnorm6_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          93,
          0,
          0
        ],
        [
          94,
          0,
          0
        ],
        [
          95,
          0,
          0
        ],
        [
          96,
          0,
          1
        ],
        [
          97,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A1_relu6_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          98,
          0,
          0
        ]
      ]
    },
    {
      "op": "Concat",
      "name": "inception30_A1_concat0",
      "attrs": {
        "dim": "1",
        "num_args": "4"
      },
      "inputs": [
        [
          50,
          0,
          0
        ],
        [
          66,
          0,
          0
        ],
        [
          90,
          0,
          0
        ],
        [
          99,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          100,
          0,
          0
        ],
        [
          101,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm0_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm0_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm0_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm0_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A2_batchnorm0_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          102,
          0,
          0
        ],
        [
          103,
          0,
          0
        ],
        [
          104,
          0,
          0
        ],
        [
          105,
          0,
          1
        ],
        [
          106,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A2_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          107,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(48, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "48",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          100,
          0,
          0
        ],
        [
          109,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm1_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm1_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm1_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm1_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(48,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A2_batchnorm1_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          110,
          0,
          0
        ],
        [
          111,
          0,
          0
        ],
        [
          112,
          0,
          0
        ],
        [
          113,
          0,
          1
        ],
        [
          114,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A2_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          115,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 48, 5, 5)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(5, 5)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(2, 2)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          116,
          0,
          0
        ],
        [
          117,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm2_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm2_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm2_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm2_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A2_batchnorm2_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          118,
          0,
          0
        ],
        [
          119,
          0,
          0
        ],
        [
          120,
          0,
          0
        ],
        [
          121,
          0,
          1
        ],
        [
          122,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A2_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          123,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 256, 1, 1)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(1, 1)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          100,
          0,
          0
        ],
        [
          125,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm3_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm3_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm3_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm3_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A2_batchnorm3_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          126,
          0,
          0
        ],
        [
          127,
          0,
          0
        ],
        [
          128,
          0,
          0
        ],
        [
          129,
          0,
          1
        ],
        [
          130,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A2_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          131,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(96, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          132,
          0,
          0
        ],
        [
          133,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm4_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm4_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm4_running_mean",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm4_running_var",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "inception30_A2_batchnorm4_fwd",
      "attrs": {
        "axis": "1",
        "eps": "0.001",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "False"
      },
      "inputs": [
        [
          134,
          0,
          0
        ],
        [
          135,
          0,
          0
        ],
        [
          136,
          0,
          0
        ],
        [
          137,
          0,
          1
        ],
        [
          138,
          0,
          1
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "inception30_A2_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          139,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__lr_mult__": "1.0",
        "__shape__": "(96, 96, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "inception30_A2_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "True",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          140,
          0,
          0
        ],
        [
          141,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm5_gamma",
      "attrs": {
        "__dtype__": "0",
        "__init__": "ones",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "inception30_A2_batchnorm5_beta",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(96,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
