{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 3, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv0_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          0,
          0,
          0
        ],
        [
          1,
          0,
          0
        ],
        [
          2,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu0_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          3,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(64, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(64,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv1_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          4,
          0,
          0
        ],
        [
          5,
          0,
          0
        ],
        [
          6,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu1_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          7,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "vgg0_pool0_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          8,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv2_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 64, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv2_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv2_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          9,
          0,
          0
        ],
        [
          10,
          0,
          0
        ],
        [
          11,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu2_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          12,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv3_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(128, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv3_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(128,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv3_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          13,
          0,
          0
        ],
        [
          14,
          0,
          0
        ],
        [
          15,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu3_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          16,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "vgg0_pool1_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          17,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv4_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 128, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv4_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv4_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          18,
          0,
          0
        ],
        [
          19,
          0,
          0
        ],
        [
          20,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu4_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          21,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv5_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv5_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv5_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          22,
          0,
          0
        ],
        [
          23,
          0,
          0
        ],
        [
          24,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu5_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          25,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv6_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(256, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv6_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(256,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv6_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "256",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          26,
          0,
          0
        ],
        [
          27,
          0,
          0
        ],
        [
          28,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu6_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          29,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "vgg0_pool2_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          30,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv7_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 256, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv7_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv7_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          31,
          0,
          0
        ],
        [
          32,
          0,
          0
        ],
        [
          33,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu7_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          34,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv8_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv8_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv8_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          35,
          0,
          0
        ],
        [
          36,
          0,
          0
        ],
        [
          37,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu8_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          38,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv9_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv9_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv9_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          39,
          0,
          0
        ],
        [
          40,
          0,
          0
        ],
        [
          41,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu9_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          42,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "vgg0_pool3_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          43,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv10_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv10_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv10_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          44,
          0,
          0
        ],
        [
          45,
          0,
          0
        ],
        [
          46,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu10_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          47,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv11_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv11_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv11_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          48,
          0,
          0
        ],
        [
          49,
          0,
          0
        ],
        [
          50,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu11_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          51,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_conv12_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 2}]",
        "__lr_mult__": "1.0",
        "__shape__": "(512, 512, 3, 3)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_conv12_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(512,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "vgg0_conv12_fwd",
      "attrs": {
        "dilate": "(1, 1)",
        "kernel": "(3, 3)",
        "layout": "NCHW",
        "no_bias": "False",
        "num_filter": "512",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)"
      },
      "inputs": [
        [
          52,
          0,
          0
        ],
        [
          53,
          0,
          0
        ],
        [
          54,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_relu12_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          55,
          0,
          0
        ]
      ]
    },
    {
      "op": "Pooling",
      "name": "vgg0_pool4_fwd",
      "attrs": {
        "global_pool": "False",
        "kernel": "(2, 2)",
        "layout": "NCHW",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "valid",
        "stride": "(2, 2)"
      },
      "inputs": [
        [
          56,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_dense0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "normal",
        "__lr_mult__": "1.0",
        "__shape__": "(4096, 25088)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_dense0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(4096,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "vgg0_dense0_fwd",
      "attrs": {
        "flatten": "True",
        "no_bias": "False",
        "num_hidden": "4096"
      },
      "inputs": [
        [
          57,
          0,
          0
        ],
        [
          58,
          0,
          0
        ],
        [
          59,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_dense0_relu_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          60,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "vgg0_dropout0_fwd",
      "attrs": {
        "axes": "()",
        "cudnn_off": "False",
        "p": "0.9"
      },
      "inputs": [
        [
          61,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "vgg0_dense1_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "normal",
        "__lr_mult__": "1.0",
        "__shape__": "(4096, 4096)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "vgg0_dense1_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(4096,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "vgg0_dense1_fwd",
      "attrs": {
        "flatten": "True",
        "no_bias": "False",
        "num_hidden": "4096"
      },
      "inputs": [
        [
          62,
          0,
          0
        ],
        [
          63,
          0,
          0
        ],
        [
          64,
          0,
          0
        ]
      ]
    },
    {
      "op": "Activation",
      "name": "vgg0_dense1_relu_fwd",
      "attrs": {
        "act_type": "relu"
      },
      "inputs": [
        [
          65,
          0,
          0
        ]
      ]
    },
    {
      "op": "Dropout",
      "name": "vgg0_dropout1_fwd",
      "attrs": {
        "axes": "()",
        "cudnn_off": "False",
        "p": "0.9"
      },
      "inputs": [
        [
          66,
          0,
          0
        ]
      ]
    },
    {
      "op": "null",
      "name": "dense0_weight",
      "attrs": {
        "__dtype__": "0",
        "__init__": "[\"normal\", {\"sigma\": 0.001}]",
        "__lr_mult__": "1.0",
        "__shape__": "(101, 4096)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "dense0_bias",
      "attrs": {
        "__dtype__": "0",
        "__init__": "zeros",
        "__lr_mult__": "1.0",
        "__shape__": "(101,)",
        "__storage_type__": "0",
        "__wd_mult__": "1.0"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "dense0_fwd",
      "attrs": {
        "flatten": "True",
        "no_bias": "False",
        "num_hidden": "101"
      },
      "inputs": [
        [
          67,
          0,
          0
        ],
        [
          68,
          0,
          0
        ],
        [
          69,
          0,
          0
        ]
      ]
    }
  ],
  "arg_nodes": [
    0,
    1,
    2,
    5,
    6,
    10,
    11,
    14,
    15,
    19,
    20,
    23,
    24,
    27,
    28,
    32,
    33,
    36,
    37,
    40,
    41,
    45,
    46,
    49,
    50,
    53,
    54,
    58,
    59,
    63,
    64,
    68,
    69
  ],
  "node_row_ptr": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    63,
    64,
    65,
    66,
    67,
    69,
    70,
    71,
    72,
    73,
    75,
    76,
    77,
    78
  ],
  "heads": [
    [
      70,
      0,
      0
    ]
  ],
  "attrs": {
    "mxnet_version": [
      "int",
      10500
    ]
  }
}